app/Controllers/TaskController.php

SELECT *
FROM `tasks`
WHERE `task_date` = '2026-10-07'
---
    public function welcome()
    {
        $taskModel = new TaskModel();

        // Query tasks where task_date equals today's date
        $todayDate = date('Y-m-d');
        $data['tasks'] = $taskModel->where('task_date', $todayDate)->findAll();

SELECT *
FROM `tasks`
ORDER BY `task_date` ASC
---
    public function index()
    {
        $taskModel = new TaskModel();

        // Query every task ordered by date
        $data['tasks'] = $taskModel->orderBy('task_date', 'ASC')->findAll();