app/Controllers/UserController.php

SELECT *
FROM `users`
 LIMIT 1
---
    public function index()
    {
        $userModel = new UserModel();

        // Retrieve the single demo user row
        $data['user'] = $userModel->first();